pmo-dataset/mermaid/31.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1(("Account is set up")) --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> User_1["Create character\nnames"]
	Service_1["Check if battle.net\naccount exists"] --> ExclusiveGateway_1{"Does an account\nexist?"}
	ExclusiveGateway_1 -->|"No"| User_2["Create battle.net\naccount"]
	User_2 --> User_3["Confirm registration\nvia email link"]
	User_3 --> ExclusiveGateway_2{"X"}
	ParallelGateway_1 --> Service_1
	ExclusiveGateway_2 --> Service_2["Check if active WoW\nsubscription exists"]
	Service_2 --> ExclusiveGateway_3{"Does a subscription\nexist?"}
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_4{"Select payment\nmethod"}
	ParallelGateway_2{"+"} --> User_5["Enter IBAN"]
	ParallelGateway_2 --> User_6["Enter BIC"]
	User_5 --> ParallelGateway_3{"+"}
	User_4["Enter credit card\ninformation"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_3 --> ExclusiveGateway_5
	ExclusiveGateway_1 -->|"Yes"| ExclusiveGateway_2
	User_6 --> ParallelGateway_3
	ExclusiveGateway_4 -->|"Credit card"| User_4
	ExclusiveGateway_5 --> User_7["Log into the game"]
	User_7 --> ParallelGateway_4{"+"}
	ParallelGateway_4 --> User_8["Select realm"]
	ParallelGateway_4 --> User_9["Select race"]
	ParallelGateway_4 --> User_10["Select class"]
	User_9 --> ParallelGateway_8{"+"}
	User_8 --> ParallelGateway_8
	User_10 --> ParallelGateway_8
	ParallelGateway_8 --> ParallelGateway_5{"+"}
	User_1 --> ParallelGateway_5
	User_11["Enter character name"] --> ExclusiveGateway_6{"Name available?"}
	ParallelGateway_5 --> ExclusiveGateway_7{"X"}
	ExclusiveGateway_7 --> User_11
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_7
	ExclusiveGateway_6 -->|"Yes"| ParallelGateway_6{"+"}
	ParallelGateway_6 --> Service_4["Recieve character\nselfies"]
	ParallelGateway_6 --> Service_3["Recieve confirmation"]
	Service_3 --> ParallelGateway_7{"+"}
	ParallelGateway_7 --> EndNoneEvent_1(("Character created")):::endEvent
	ExclusiveGateway_4 -->|"Bank account"| ParallelGateway_2
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_5
	Service_4 --> ParallelGateway_7
