pmo-dataset/variations/graphviz_with_ids/31.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Create character\nnames"];
  "User_2" [label="Create battle.net\naccount"];
  "User_3" [label="Confirm registration\nvia email link"];
  "User_4" [label="Enter credit card\ninformation"];
  "User_5" [label="Enter IBAN"];
  "User_6" [label="Enter BIC"];
  "User_7" [label="Log into the game"];
  "User_8" [label="Select realm"];
  "User_9" [label="Select race"];
  "User_10" [label="Select class"];
  "User_11" [label="Enter character name"];
  "Service_1" [label="Check if battle.net\naccount exists"];
  "Service_2" [label="Check if active WoW\nsubscription exists"];
  "Service_3" [label="Recieve confirmation"];
  "Service_4" [label="Recieve character\nselfies"];
  "StartNoneEvent_1" [shape=circle, label="Account is set up"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Character created"];
  "ExclusiveGateway_1" [shape=diamond, label="Does an account\nexist?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="Does a subscription\nexist?"];
  "ExclusiveGateway_4" [shape=diamond, label="Select payment\nmethod"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="Name available?"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];
  "ParallelGateway_7" [shape=diamond, label="+"];
  "ParallelGateway_8" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "User_1";
  "Service_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "User_2" [label="No"];
  "User_2" -> "User_3";
  "User_3" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Service_1";
  "ExclusiveGateway_2" -> "Service_2";
  "Service_2" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="No"];
  "ParallelGateway_2" -> "User_5";
  "ParallelGateway_2" -> "User_6";
  "User_5" -> "ParallelGateway_3";
  "User_4" -> "ExclusiveGateway_5";
  "ParallelGateway_3" -> "ExclusiveGateway_5";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2" [label="Yes"];
  "User_6" -> "ParallelGateway_3";
  "ExclusiveGateway_4" -> "User_4" [label="Credit card"];
  "ExclusiveGateway_5" -> "User_7";
  "User_7" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "User_8";
  "ParallelGateway_4" -> "User_9";
  "ParallelGateway_4" -> "User_10";
  "User_9" -> "ParallelGateway_8";
  "User_8" -> "ParallelGateway_8";
  "User_10" -> "ParallelGateway_8";
  "ParallelGateway_8" -> "ParallelGateway_5";
  "User_1" -> "ParallelGateway_5";
  "User_11" -> "ExclusiveGateway_6";
  "ParallelGateway_5" -> "ExclusiveGateway_7";
  "ExclusiveGateway_7" -> "User_11";
  "ExclusiveGateway_6" -> "ExclusiveGateway_7" [label="No"];
  "ExclusiveGateway_6" -> "ParallelGateway_6" [label="Yes"];
  "ParallelGateway_6" -> "Service_4";
  "ParallelGateway_6" -> "Service_3";
  "Service_3" -> "ParallelGateway_7";
  "ParallelGateway_7" -> "EndNoneEvent_1";
  "ExclusiveGateway_4" -> "ParallelGateway_2" [label="Bank account"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_5" [label="Yes"];
  "Service_4" -> "ParallelGateway_7";
}
